'''
1.判断下面标识符是否合法并说明不合法的原因
	@abc.com       不合法，原因：标识符是数字、字母、下划线组成的字符串
	123ok          不合法，原因：标识符第一个字符不是数字。
	_xiaoming      合法
	Xiaoming_$     不合法，原因：标识符是数字、字母、下划线组成的字符串
	interface      合法
	sina@163       不合法，原因：标识符是数字、字母、下划线组成的字符串
'''
'''
2.从控制台输入圆的半径，计算周长和面积
'''
r1 = int(input("输入圆的半径:"))
print("周长等于：",2 * 3.1415926535898 * r1)
print("面积等于：",3.1415926535898 * r1 ** 2)
'''
3.一辆汽车以40km/h的速度行驶,行驶了45678.9km,求所用的时间
'''
a = 40
b = 45678.9
print(b / a,"小时")
'''
4.从控制台输入两个数，输出较大的值[只能一个一个录入]
'''
a1 = int(input("输入第一个数"))
b1 = int(input("输入第二个数"))
if a1 >= b1:
    print(a1)
else:
    print(b1)
'''
5.从控制台输入三个数，输出较大的值
'''
a2 = int(input("输入第一个数"))
b2 = int(input("输入第二个数"))
c2 = int(input("输入第二个数"))
if a2 >= b2 :
    if a2 >= c2:
        print(a2)
    else:
        print(c2)
else:
    if b2 >= c2:
        print(b2)
    else:
        print(c2)
'''
6.从控制台输入一个三位数，如果是水仙花数就得出结果“是水仙花数”，否则结果为“不是水仙花数”
	例如：153=1^3+5^3+3^3
个位上:   num % 10 ====> num / 10 获得余数
十位数:  num // 10 % 10   153//10 ===> 15  15% 10 ===> 5
百位数 num // 100
Bw = num // 100
Sw = (num - bw * 100) // 10
只有三位数的时候才有水仙花数:
	将每一位上的数据提取出来 求立方 和 和的结果与数据本身一致 就是水仙花数
'''
a3 = int(input("输入一个三位数"))
gw = a3 % 10
bw = a3 // 100
sw = (a3 - bw * 100) // 10
if a3 == bw ** 3 + sw ** 3 + gw ** 3:
    print("这是水仙花数")
else:
    print("这不是水仙花数")
'''
7.从控制台输入一个五位数，如果是回文数就得出结果“是回文数”，否则结果为“不是回文数”
	例如：11111   12321   12221   12321
百位:  num // 100 % 10
千位: num// 1000 % 10
'''
a4 = int(input("输入一个五位数"))
gw = a4 % 10
ww = a4 // 10000
sw = ((a4 - gw) / 10) % 10
qw = (a4 - ww * 10000) // 1000
if gw == ww and sw == qw:
    print("这是回文数")
else:
    print("这不是回文数")
'''
8.键盘录入一个年份 判断概念是否是闰年
	闰年条件:
		条件1:
			能被4整除 但是不能被100整除
		条件2:
			能被400整除
	条件1和条件2满足其一即可
'''
a5 = int(input("输入一个年份"))
if (a5 % 4 == 0 and a5 % 100 != 0) or a5 % 400 ==0:
    print("是闰年")
else:
    print("不是闰年")
'''
9.键盘录入一个非2月份的月份  获取其对应的天数
	1	3	5	7	8	10	12 是31天
	4	6	9	11 是30天
'''

a6 = int(input("输入月份"))
if a6 == 1 or a6 == 3 or a6 == 5 or a6 == 7 or a6 == 8 or a6 == 10 or a6 == 12:
    print("是31天")
elif a6 == 4 or a6 == 6 or a6 == 9 or a6 == 11:
    print("是30天")
else:
    pass