# 1.判断下面标识符是否合法并说明不合法的原因
# 	@abc.com            # 不合法 @
# 	123ok               # 不合法 数字开头
# 	_xiaoming           # 合法
# 	Xiaoming_$          # 不合法 $
# 	interface           # 合法
# 	sina@163            # 不合法 @
#
#
# 2.从控制台输入圆的半径，计算周长和面积
# r = float(input())
# c = 3.14 * r * 2
# a = 3.14 * r ** 2
# print(c, a)
#
# 3.一辆汽车以40km/h的速度行驶,行驶了45678.9km,求所用的时间
# print(45678.9 / 40)
#
#
#
# 4.从控制台输入两个数，输出较大的值[只能一个一个录入]
#
# a = int(input())
# b = int(input())
# if a > b:
#     print(a)
# else:
#     print(b)
#
# 5.从控制台输入三个数，输出较大的值
# a, b, c = int(input()), int(input()), int(input())
# max = a
# if b > max:
#     max = b
# # 此时max是a b中最大的数
# if c > max:
#     max = c
# print(max)
#
# 6.从控制台输入一个三位数，如果是水仙花数就得出结果“是水仙花数”，否则结果为“不是水仙花数”
# 	例如：153=1^3+5^3+3^3
# 个位上:   num % 10 ====> num / 10 获得余数
# 十位数:  num // 10 % 10   153//10 ===> 15  15% 10 ===> 5
# 百位数 num // 100
#
# Bw = num // 100
# Sw = (num - bw * 100) // 10
#
# 只有三位数的时候才有水仙花数:
# 	将每一位上的数据提取出来 求立方 和 和的结果与数据本身一致 就是水仙花数

# n = int(input())
# b: bool     # 用于标记是否是否是水仙花数
# if 100 <= n < 1000:
#     bit0 = n % 10           # 获得个位数  153 % 10 == 3
#     bit1 = n // 10 % 10     # 获得十位数  153 // 10 == 15 % 10 == 5
#     bit2 = n // 100         # 获得百位数  153 // 100 == 1
#     if n == bit0 ** 3 + bit1 ** 3 + bit2 ** 3:
#         b = True
#     else:
#         b = False
# else:
#     b = False
#
#
# if b:
#     print("是水仙花数！")
# else:
#     print("不是水仙花数！")

#
#
# 7.从控制台输入一个五位数，如果是回文数就得出结果“是回文数”，否则结果为“不是回文数”
#
# 	例如：11111   12321   12221
#
# 12321
#
# 百位:  num // 100 % 10
# 千位: num// 1000 % 10

# n = int(input())
#
# bit0 = n % 10           # 个位
# bit1 = n // 10 % 10     # 十位   12345  // 10 -> 1234 % 10 -> 4
# bit3 = n // 1000 % 10   # 千位   12345  // 1000 -> 12 % 10 -> 2
# bit4 = n // 10000       # 万位
# if bit0 == bit4 and bit1 == bit3:
#     print("是回文数")
# else:
#     print("不是回文数")


# 8.键盘录入一个年份 判断概念是否是闰年
# 	闰年条件:
# 		条件1:
# 			能被4整除 但是不能被100整除
# 		条件2:
# 			能被400整除
# 	条件1和条件2满足其一即可
y = int(input())
# 与的优先级是高于或的
# if y % 4 == 0 and y % 100 != 0 or y % 400 == 0:
#     print("是闰年")
# else:
#     print("不是闰年")

#
# 9.键盘录入一个非2月份的月份  获取其对应的天数
# 	1	3	5	7	8	10	12 是31天
# 	4	6	9	11 是30天
n = int(input())
if 1 <= n <= 12 and n != 2:
    if n == 4 or n == 6 or n == 9 or n == 11:
        print("30天")
    else:
        print("31天")
else:
    print("输入错误")
